{
  "_name_or_path": "meta-llama/Llama-3.1-70B-Instruct",  // Base model path
  "architectures": [
    "LlamaForCausalLM"  // Model architecture class name
  ],
  "attention_bias": false,  // Whether to use attention bias
  "attention_dropout": 0.0,  // Dropout probability for attention
  "bos_token_id": 128000,  // Beginning of sequence token ID
  "eos_token_id": [
    128001,
    128008,
    128009
  ],  // End of sequence token IDs
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 8192,  // Size of hidden layers
  "initializer_range": 0.02,
  "intermediate_size": 28672,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 64,  // Number of attention heads
  "num_hidden_layers": 80,  // Number of transformer layers
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 8.0,  // Overall scaling factor
    "high_freq_factor": 4.0,  // High frequencies scaling
    "low_freq_factor": 1.0,  // Low frequencies scaling
    "original_max_position_embeddings": 8192,  // Original max sequence length
    "rope_type": "llama3"  // RoPE implementation type
  },
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.0",
  "use_cache": true,
  "vocab_size": 128256  // Size of model vocabulary
}
